IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_UART1.xml
	<register id="MEM_XOFF1" acronym="MEM_XOFF1" offset="0x18" width="32" description="XOFF1 Register">
		<bitfield id="XOFF_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF1 character in used in UART modes." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SPR" acronym="MEM_SPR" offset="0x1C" width="32" description="This read/write register does not control the module in anyway. It is intended as a scratchpad register to be used by the programmer to hold temporary data.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="SPR_WORD" width="8" begin="7" end="0" resetval="0x0" description="Scratchpad register" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_TLR" acronym="MEM_TLR" offset="0x1C" width="32" description="Trigger Level Register">
		<bitfield id="RX_FIFO_TRIG_DMA" width="4" begin="7" end="4" resetval="0x0" description="Receive FIFO trigger level" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="TX_FIFO_TRIG_DMA" width="4" begin="3" end="0" resetval="0x0" description="Transmit FIFO trigger level" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_XOFF2" acronym="MEM_XOFF2" offset="0x1C" width="32" description="XOFF2 Register">
		<bitfield id="XOFF_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF2 character in used in UART modes." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MDR1" acronym="MEM_MDR1" offset="0x20" width="32" description="The mode of operation can be programmed by writing to MDR1[2:0] and therefore the MDR1 must be programmed on start-up after configuration of the configuration registers (DLL, DLH, LCR). The value of MDR1[2:0] must not be changed again during normal operation. 

Note: If the module is disabled by setting the MODE_SELECT field to">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="FRAME_END_MODE" width="1" begin="7" end="7" resetval="0x0" description="IrDA mode only." range="7" rwaccess="R/W"/> 
		<bitfield id="SIP_MODE" width="1" begin="6" end="6" resetval="0x0" description="MIR/FIR modes only." range="6" rwaccess="R/W"/> 
		<bitfield id="SCT" width="1" begin="5" end="5" resetval="0x0" description="Store and control the transmission" range="5" rwaccess="R/W"/> 
		<bitfield id="SET_TXIR" width="1" begin="4" end="4" resetval="0x0" description="Used to configure the infrared transceiver." range="4" rwaccess="R/W"/> 
		<bitfield id="IR_SLEEP" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="MODE_SELECT" width="3" begin="2" end="0" resetval="0x7" description="" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MDR2" acronym="MEM_MDR2" offset="0x24" width="32" description="IR-IrDA and IR-CIR modes only.

MDR2[0] describes the status of the interrupt in IIR[5]. The IRTX_UNDERRUN bit should be read after an IIR[5] TX_STATUS_IT interrupt has occurred. The bits [2:1] of this register sets the trigger level for the frame status FIFO (8 entries) and must be programmed before the mode is programmed in MDR1[2:0].

Note: The MDR2[6] gives the flexibility to invert the RX pin inside the UART module to ensure that the protocol at the input of the transceiver module has the same polarity at module level. By default, the RX pin is inverted because most of transceiver invert the IR receive pin.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="SET_TXIR_ALT" width="1" begin="7" end="7" resetval="0x0" description="Provide alternate functionnality for MDR1[4] [SET_TXIR]" range="7" rwaccess="R/W"/> 
		<bitfield id="IRRXINVERT" width="1" begin="6" end="6" resetval="0x0" description="Only for IR mode [IRDA &#38; CIR]Invert RX pin inside the module before the voting or sampling system logic of the infra red block. This will not affect the RX path in UART Modem modes." range="6" rwaccess="R/W"/> 
		<bitfield id="CIR_PULSE_MODE" width="2" begin="5" end="4" resetval="0x0" description="CIR Pulse modulation definition. It defines high level of the pulse width associated with a digit:" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="UART_PULSE" width="1" begin="3" end="3" resetval="0x0" description="UART mode only. Used to allow pulse shaping in UART mode." range="3" rwaccess="R/W"/> 
		<bitfield id="STS_FIFO_TRIG" width="2" begin="2" end="1" resetval="0x0" description="Only for IR-IRDA mode. Frame Status FIFO Threshold select:" range="2 - 1" rwaccess="R/W"/> 
		<bitfield id="IRTX_UNDERRUN" width="1" begin="0" end="0" resetval="0x0" description="IRDA Transmission status interrupt.When the IIR[5] interrupt occurs, the meaning of the interrupt is :" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_SFLSR" acronym="MEM_SFLSR" offset="0x28" width="32" description="IrDA modes only.

Reading this register effectively reads frame status information from the status FIFO (this register doesn't physically exist). Reading this register will increment the status FIFO read pointer (SFREGL and SFREGH must be read first).">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED5" width="3" begin="7" end="5" resetval="0x0" description="" range="7 - 5" rwaccess="R"/> 
		<bitfield id="OE_ERROR" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R"/> 
		<bitfield id="FRAME_TOO_LONG_ERROR" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R"/> 
		<bitfield id="ABORT_DETECT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R"/> 
		<bitfield id="CRC_ERROR" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="RESERVED0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_TXFLL" acronym="MEM_TXFLL" offset="0x28" width="32" description="IrDA modes only.

The registers TXFLL and TXFLH hold the 13-bit transmit frame length (expressed in bytes). TXFLL holds the least significant bits and TXFLH holds the most significant bits. The frame length value is used if the frame length method of frame closing is used.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="TXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length" range="7 - 0" rwaccess="W"/>
	</register>
	<register id="MEM_RESUME" acronym="MEM_RESUME" offset="0x2C" width="32" description="IR-IrDA and IR-CIR modes only.

